# QTOpenMovieFileN

```pascal
FUNCTION QTOpenMovieFileN(
				movieRef    : INTEGER;
				fileName    : STRING;
				frameWidth  : LONGINT;
				frameHeight : LONGINT): INTEGER;
```

```python
def vs.QTOpenMovieFileN(movieRef, fileName, frameWidth, frameHeight):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|movieRef|INTEGER|MovieRefID that was already created with QTCreateMovieRefID.|
|fileName|STRING|Name of movie file.|
|frameWidth|LONGINT|Frame width of the movie file.|
|frameHeight|LONGINT|Frame height of the movie file.|

## Version
Availability: from Vectorworks 2018

## Category
* Special - QuickTime